name: "torch_model"
platform: "pytorch_libtorch"
max_batch_size: 1

input [
  {
    name: "%inputs"
    data_type: TYPE_FP32
    dims: [1, 3, -1, -1]
  }
]

output [
  {
    name: "%6593"
    data_type: TYPE_FP32
    dims: [-1, 4]
  },
  {
    name: "%6544"
    data_type: TYPE_FP32
    dims: [-1]
  },
  {
    name: "%6546"
    data_type: TYPE_FP32
    dims: [-1]
  }
]
