name: "torch_model"
platform: "pytorch_libtorch"
max_batch_size: 3

input [
  {
    name: "%inputs"
    data_type: TYPE_FP32
    dims: [3, -1, -1]
  }
]

output [
  {
    name: "%6589"
    data_type: TYPE_FP32
    dims: [-1, 4]
  },
  {
    name: "%6540"
    data_type: TYPE_FP32
    dims: [-1]
  },
  {
    name: "%6542"
    data_type: TYPE_FP32
    dims: [-1]
  }
]
