name: "tensorflow_model"
platform: "tensorflow_savedmodel"
max_batch_size: 16

# model = tf.saved_model.load('model.savedmodel')
# model.signature
# you can get input and output name

input [
  {
    name: "keras_tensor"
    data_type: TYPE_FP32
    dims: [-1, -1, 3]
  }
]

output [
  {
    name: "output_0"
    data_type: TYPE_FP32
    dims: [-1, -1, 1024]
  }
]
