name: "tensorflow_model"
platform: "tensorflow_savedmodel"
max_batch_size: 16

input [
  {
    name: "input_tensor"
    data_type: TYPE_FP32
    dims: [-1, 224, 224, 3]
  }
]

output [
  {
    name: "feature"
    data_type: TYPE_FP32
    dims: [-1, 1024]
  }
]
