name: "tensorflow_model"
platform: "tensorflow_savedmodel"
max_batch_size: 16

input [
  {
    name: "inputs"
    data_type: TYPE_FP32
    dims: [224, 224, 3]
  }
]

output [
  {
    name: "output_0"
    data_type: TYPE_FP32
    dims: [-1, 1024]
  }
]
